In [28]:
import pandas as pd  
import numpy as np

# merge()

merge() performs join operations similar to relational databases like SQL.
 
# Merge types
merge() implements common SQL style joining operations.

one-to-one: joining two DataFrame objects on their indexes which must contain unique values.

many-to-one: joining a unique index to one or more columns in a different DataFrame.

many-to-many : joining columns on columns.

In [29]:
left = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [30]:
right = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [31]:
result = pd.merge(left, right, on="key")
result

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

left

LEFT OUTER JOIN

Use keys from left frame only

right

RIGHT OUTER JOIN

Use keys from right frame only

outer

FULL OUTER JOIN

Use union of keys from both frames

inner

INNER JOIN

Use intersection of keys from both frames

cross

CROSS JOIN

Create the cartesian product of rows of both frames

In [32]:
left = pd.DataFrame(
   {
      "key1": ["K0", "K0", "K1", "K2"],
      "key2": ["K0", "K1", "K0", "K1"],
      "A": ["A0", "A1", "A2", "A3"],
      "B": ["B0", "B1", "B2", "B3"],
   }
)

In [33]:
right = pd.DataFrame(
   {
      "key1": ["K0", "K1", "K1", "K2"],
      "key2": ["K0", "K0", "K0", "K0"],
      "C": ["C0", "C1", "C2", "C3"],
      "D": ["D0", "D1", "D2", "D3"],
   }
)

Left Merge

In [34]:
result = pd.merge(left, right, how="left", on=["key1", "key2"])
result

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

Right merge

In [35]:
result = pd.merge(left, right, how="right", on=["key1", "key2"])
result

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

For outer merge

In [36]:
result = pd.merge(left,right , how = "outer" , on = ['key1','key2'])
result

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

Inner merge

In [37]:
result = pd.merge(left,right , how = 'inner',on=['key1','key2'])
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

# Merge key uniqueness

In [38]:
left = pd.DataFrame({"A": [1, 2], "B": [1, 2]})
left

   A  B
0  1  1
1  2  2

In [39]:
right = pd.DataFrame({"A": [4, 5, 6], "B": [2, 2, 2]})
right

   A  B
0  4  2
1  5  2
2  6  2

In [40]:
result = pd.merge(left,right , on = 'B' , how = 'outer',validate='one_to_one')

MergeError: Merge keys are not unique in right dataset; not a one-to-one merge

In [ ]:
pd.merge(left, right, on="B", how="outer", validate="one_to_many")

   A_x  B  A_y
0    1  1  NaN
1    2  2  4.0
2    2  2  5.0
3    2  2  6.0

#  DataFrame.join()

In [ ]:
left = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [ ]:
right = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

to join the two different dataframe

In [ ]:
result = left.join(right)
result

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [ ]:
result = left.join(right, how="outer")
result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Reshaping and pivot tables

pivot()

Data is often stored in so-called “stacked” or “record” format. In a “record” or “wide” format, typically there is one row for each subject. In the “stacked” or “long” format there are multiple rows for each subject where applicable

In [ ]:
data = {  
        
        "value" : range(12),
        "variable" : ['A'] * 3 + ['B'] * 3 + ['C'] * 3 + ['D'] * 3 ,
        "date" : pd.to_datetime(["2025-01-03", "2025-01-04", "2025-01-05"]  * 4)
        
        
        }
data

{'value': range(0, 12),
 'variable': ['A', 'A', 'A', 'B', 'B', 'B', 'C', 'C', 'C', 'D', 'D', 'D'],
 'date': DatetimeIndex(['2025-01-03', '2025-01-04', '2025-01-05', '2025-01-03',
                '2025-01-04', '2025-01-05', '2025-01-03', '2025-01-04',
                '2025-01-05', '2025-01-03', '2025-01-04', '2025-01-05'],
               dtype='datetime64[ns]', freq=None)}

In [ ]:
df = pd.DataFrame(data)
df

    value variable       date
0       0        A 2025-01-03
1       1        A 2025-01-04
2       2        A 2025-01-05
3       3        B 2025-01-03
4       4        B 2025-01-04
5       5        B 2025-01-05
6       6        C 2025-01-03
7       7        C 2025-01-04
8       8        C 2025-01-05
9       9        D 2025-01-03
10     10        D 2025-01-04
11     11        D 2025-01-05

In [ ]:
pivoted = df.pivot(index='date',columns='variable',values = 'value')
pivoted

variable    A  B  C   D
date
2025-01-03  0  3  6   9
2025-01-04  1  4  7  10
2025-01-05  2  5  8  11

In [ ]:
df['values2'] = df['value'] * 2

In [ ]:
pivoted = df.pivot(index="date", columns="variable")
pivoted

           value           values2
variable       A  B  C   D       A   B   C   D
date
2025-01-03     0  3  6   9       0   6  12  18
2025-01-04     1  4  7  10       2   8  14  20
2025-01-05     2  5  8  11       4  10  16  22

In [ ]:
pivoted['values2']

variable    A   B   C   D
date
2025-01-03  0   6  12  18
2025-01-04  2   8  14  20
2025-01-05  4  10  16  22

pivot_table()

In [42]:
import datetime  

df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 6,
        "B": ["A", "B", "C"] * 8,
        "C": ["Raghav", "Ravi", "Amit", "Keshav", "Pankaj", "jashan"] * 4,
        "D": np.random.randn(24),
        "E": np.random.randn(24),
        "F": [datetime.datetime(2013, i, 1) for i in range(1, 13)]
        + [datetime.datetime(2013, i, 15) for i in range(1, 13)],
    }
)
df

        A  B       C         D         E          F
0     one  A  Raghav -2.128538 -0.796127 2013-01-01
1     one  B    Ravi -3.646712  0.301266 2013-02-01
2     two  C    Amit -1.532868 -1.268245 2013-03-01
3   three  A  Keshav  0.412815 -0.701091 2013-04-01
4     one  B  Pankaj  0.020095 -0.459587 2013-05-01
5     one  C  jashan -1.469902 -0.326247 2013-06-01
6     two  A  Raghav  0.462262 -0.872504 2013-07-01
7   three  B    Ravi -0.264334  0.830887 2013-08-01
8     one  C    Amit -0.670372 -0.301042 2013-09-01
9     one  A  Keshav  0.435384  0.697732 2013-10-01
10    two  B  Pankaj -1.757458  0.285904 2013-11-01
11  three  C  jashan  1.395404 -0.154720 2013-12-01
12    one  A  Raghav -0.520336 -0.244385 2013-01-15
13    one  B    Ravi -0.491064  0.402957 2013-02-15
14    two  C    Amit -0.514448  0.492236 2013-03-15
15  three  A  Keshav  0.426731 -0.196375 2013-04-15
16    one  B  Pankaj  2.350601 -0.248751 2013-05-15
17    one  C  jashan -0.017592  1.152233 2013-06-15
18    two  A  Raghav -0.210701 -2.320497 2013-07-15
19  three  B    Ravi -0.091944 -1.969494 2013-08-15
20    one  C    Amit  2.808766  0.618398 2013-09-15
21    one  A  Keshav  0.091861  0.647999 2013-10-15
22    two  B  Pankaj -0.368676  1.011427 2013-11-15
23  three  C  jashan -0.294471  1.148560 2013-12-15

In [ ]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C            Amit    Keshav    Pankaj    Raghav      Ravi    jashan
A     B
one   A       NaN -0.440547       NaN  0.538877       NaN       NaN
      B       NaN       NaN  0.244398       NaN  1.253649       NaN
      C  0.391799       NaN       NaN       NaN       NaN  0.550784
three A       NaN -0.561352       NaN       NaN       NaN       NaN
      B       NaN       NaN       NaN       NaN  0.264656       NaN
      C       NaN       NaN       NaN       NaN       NaN  1.446216
two   A       NaN       NaN       NaN -0.856278       NaN       NaN
      B       NaN       NaN  0.274481       NaN       NaN       NaN
      C -0.157523       NaN       NaN       NaN       NaN       NaN

In [ ]:
pd.pivot_table(
    df, values=["D", "E"],
    index=["B"],
    columns=["A", "C"],
    aggfunc="sum",
)

          D                                                              \
A       one                                                       three
C      Amit    Keshav    Pankaj    Raghav      Ravi    jashan    Keshav
B
A       NaN -0.881093       NaN  1.077754       NaN       NaN -1.122704
B       NaN       NaN  0.488796       NaN  2.507298       NaN       NaN
C  0.783599       NaN       NaN       NaN       NaN  1.101568       NaN

                                 ...         E                                \
A                           two  ...       one
C      Ravi    jashan      Amit  ...    Pankaj    Raghav      Ravi    jashan
B                                ...
A       NaN       NaN       NaN  ...       NaN  1.329664       NaN       NaN
B  0.529312       NaN       NaN  ... -1.520695       NaN  1.228386       NaN
C       NaN  2.892432 -0.315046  ...       NaN       NaN       NaN  0.542487


A     three                           two
C    Keshav      Ravi    jashan      Amit    Pankaj   Raghav
B
A  0.889126       NaN       NaN       NaN       NaN  1.74921
B       NaN -0.550303       NaN       NaN -1.457269      NaN
C       NaN       NaN -1.381435 -1.419776       NaN      NaN

[3 rows x 24 columns]

In [ ]:
pd.pivot_table(
    df, values="E",
    index=["B", "C"],
    columns=["A"],
    aggfunc=["sum", "mean"],
)

               sum                          mean
A              one     three       two       one     three       two
B C
A Keshav  1.804373  0.889126       NaN  0.902187  0.444563       NaN
  Raghav  1.329664       NaN  1.749210  0.664832       NaN  0.874605
B Pankaj -1.520695       NaN -1.457269 -0.760347       NaN -0.728635
  Ravi    1.228386 -0.550303       NaN  0.614193 -0.275151       NaN
C Amit    1.831304       NaN -1.419776  0.915652       NaN -0.709888
  jashan  0.542487 -1.381435       NaN  0.271243 -0.690718       NaN

# Adding margins

In [45]:
table = df.pivot_table(index=["A","B"] , columns=["C"],values = ['D','E'],margins=True,aggfunc='std')

In [46]:
table

                D                                                              \
C            Amit    Keshav    Pankaj    Raghav      Ravi    jashan       All
A     B
one   A       NaN  0.242907       NaN  1.137171       NaN       NaN  1.136383
      B       NaN       NaN  1.647917       NaN  2.231380       NaN  2.468788
      C  2.460122       NaN       NaN       NaN       NaN  1.026938  1.861323
three A       NaN  0.009840       NaN       NaN       NaN       NaN  0.009840
      B       NaN       NaN       NaN       NaN  0.121898       NaN  0.121898
      C       NaN       NaN       NaN       NaN       NaN  1.194922  1.194922
two   A       NaN       NaN       NaN  0.475857       NaN       NaN  0.475857
      B       NaN       NaN  0.982017       NaN       NaN       NaN  0.982017
      C  0.720131       NaN       NaN       NaN       NaN       NaN  0.720131
All      1.910570  0.166817  1.706396  1.098898  1.690054  1.177204  1.348602

                E
C            Amit    Keshav    Pankaj    Raghav      Ravi    jashan       All
A     B
one   A       NaN  0.035166       NaN  0.390141       NaN       NaN  0.725025
      B       NaN       NaN  0.149084       NaN  0.071907       NaN  0.418819
      C  0.650142       NaN       NaN       NaN       NaN  1.045443  0.725790
three A       NaN  0.356888       NaN       NaN       NaN       NaN  0.356888
      B       NaN       NaN       NaN       NaN  1.980169       NaN  1.980169
      C       NaN       NaN       NaN       NaN       NaN  0.921558  0.921558
two   A       NaN       NaN       NaN  1.023886       NaN       NaN  1.023886
      B       NaN       NaN  0.513022       NaN       NaN       NaN  0.513022
      C  1.244848       NaN       NaN       NaN       NaN       NaN  1.244848
All      0.870094  0.679850  0.656022  0.886727  1.261645  0.806074  0.917534

Additionally, you can call DataFrame.stack() to display a pivoted DataFrame as having a multi-level index:

In [47]:
table.stack(future_stack=True)

                     D         E
A   B C
one A Amit         NaN       NaN
      Keshav  0.242907  0.035166
      Pankaj       NaN       NaN
      Raghav  1.137171  0.390141
      Ravi         NaN       NaN
...                ...       ...
All   Pankaj  1.706396  0.656022
      Raghav  1.098898  0.886727
      Ravi    1.690054  1.261645
      jashan  1.177204  0.806074
      All     1.348602  0.917534

[70 rows x 2 columns]